"""
1.NumPy是什么？
  NumPy是一个开源的Python科学计算库。 Numerical Python

2.NumPy有什么功能
  NumPy主要的功能之一用来操作数组和矩阵。
  NumPy是科学计算、深度学习等高端领域的必备工具。
  使用TensorFlow、Caffe。框架训练神将网络模型时，需要进行大量复杂的计算，可以直接调用NumPy里面的API

  NumPy包含了很多实用的数学函数，覆盖了很多的数学领域，
  比如：线性代数、傅里叶变换、随机数生成。

  NumPy可以取代一些商用的数学软件。Matlab一个交互式环境。

  Python + NumPy == Matlab

3.为什么要使用NumPy
  (1)NumPy提供了很多高端的函数，可以对数组和矩阵进行复杂的计算，比直接使用Python语言编码更高效。
  (2)NumPy有超过10年的历史，核心算法经过了非常长的时间和很多人验证，非常稳定。
  (3)NumPy的核心算法都是由C语言编写，执行效率更高。
  (4)NumPy的扩展性非常好，可以很容易集成到其他语言中。

  (5)NumPy是开源免费的，有广泛的社区支持。
"""